# Analyze Titanic data. 
I. Start with basic EDA (Exploratory data analysis): 

1. Compute average `Age` of passengers and number of passengers who survived and not survived grouped by `Sex` and `Passenger Class` (24 numbers);

2. What can you say about survivors based on the resulting table (open question), e.g. what is the surviving ratio for females in First class compared to the Second and Third? This answer is limited to 150 words.

3. What is the average number of males and females on all boats (rounded to the closest integer)? 

Do not forget to filter out all `?` in `Life Boat` attribute.

In [1]:
import pandas as pd
import numpy as np

In [76]:
df = pd.read_csv("titanic_data.csv")
df.head()

,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Life Boat,Survived
0,First,"Allen, Miss. Elisabeth Walton",Female,29.0000,0,0,24160,211.3375,B5,Southampton,2,Yes
1,First,"Allison, Master. Hudson Trevor",Male,0.9167,1,2,113781,151.5500,C22 C26,Southampton,11,Yes
2,First,"Allison, Miss. Helen Loraine",Female,2.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,No
3,First,"Allison, Mr. Hudson Joshua Creighton",Male,30.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,No
4,First,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,No

In [77]:
df.groupby(["Survived","Sex","Passenger Class"])["Age"].mean()

Survived  Sex     Passenger Class
No        Female  First              35.200000
                  Second             34.090909
                  Third              23.418750
          Male    First              43.658163
                  Second             33.092593
                  Third              26.679598
Yes       Female  First              37.109375
                  Second             26.711051
                  Third              20.814815
          Male    First              36.168240
                  Second             17.449274
                  Third              22.436441
Name: Age, dtype: float64

In [78]:
survived = df.groupby(["Survived","Sex","Passenger Class"])["Name"].count()
survived

Survived  Sex     Passenger Class
No        Female  First                5
                  Second              12
                  Third              110
          Male    First              118
                  Second             146
                  Third              418
Yes       Female  First              139
                  Second              94
                  Third              106
          Male    First               61
                  Second              25
                  Third               75
Name: Name, dtype: int64

In [79]:
print("Female survived ratio in ")
for ind in list(["First", "Second", "Third"]):
    print(ind + " class: " + str(survived.loc[("Yes","Female",ind)] / survived.loc[("No","Female",ind)]))

Female survived ratio in
First class: 27.8
Second class: 7.833333333333333
Third class: 0.9636363636363636

In [80]:
survived[[1]]

Survived  Sex     Passenger Class
No        Female  Second             12
Name: Name, dtype: int64

In [81]:
df_onboat = df.dropna(axis='index', how='any', subset=['Life Boat'])
df_onboat['Life Boat'].unique()

array(['2', '11', '3', '10', 'D', '4', '9', '6', 'B', '8', 'A', '5', '7',
       'C', '14', '5 9', '13', '1', '15', '5 7', '8 10', '12', '16',
       '13 15 B', 'C D', '15 16', '13 15'], dtype=object)

In [82]:
female_onboat = df_onboat.groupby(["Sex","Life Boat"])["Name"].count().loc[("Female")].mean()
male_onboat = df_onboat.groupby(["Sex","Life Boat"])["Name"].count().loc[("Male")].mean()
print(round(female_onboat), round(male_onboat))

14 7

# II. Proceed with feature generation.
1. Drop the column `Life Boat`.
2. Generate new attribute `Family size` (sum up `No of Parents or Children on Board` and `No of Siblings or Spouses on Board`). What is the average family size? In which class did the biggest family travel?
Do not drop original attributes.
3. It seems that `Passenger Fare` is total among all passengers with the same `Ticket Number`: create new attribute `Single passenger fare`. For every passenger you need to compute the number of passengers with the same `Ticket Number` and then use this number as a divisor for `Passenger Fare`. 
Do not drop the original attribute.
4. Impute missing values: for numerical attributes use averaging over three groups: `Passenger Class`, `Sex`, `Embarkation Port`; for every numerical attribute create separate column that contain 1 for imputed value and 0 for originally presented. 
This step is mainly for practicing your groupby/join skills. In real tasks this kind of imputation is relatively rare.
5. Pre-process categorical attributes: For every categorical attribute create a separate column that contains 1 for imputed value and 0 for originally presented. One-hot encode categorical attributes with less than 20 unique values, drop other categorical attributes; drop original attributes. 
6. Set the role of the `Survived` attribute to `label`.

In [83]:
del df["Life Boat"]

In [84]:
df["Family size"] = df["No of Parents or Children on Board"] + df["No of Siblings or Spouses on Board"]

In [85]:
df["Family size"].mean()

0.8838808250572956

In [86]:
df[df["Family size"] == df["Family size"].max()]

,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Survived,Family size
1170,Third,"Sage, Master. Thomas Henry",Male,NaN,8,2,CA. 2343,69.55,NaN,Southampton,No,10
1171,Third,"Sage, Master. William Henry",Male,14.5,8,2,CA. 2343,69.55,NaN,Southampton,No,10
1172,Third,"Sage, Miss. Ada",Female,NaN,8,2,CA. 2343,69.55,NaN,Southampton,No,10
1173,Third,"Sage, Miss. Constance Gladys",Female,NaN,8,2,CA. 2343,69.55,NaN,Southampton,No,10
1174,Third,"Sage, Miss. Dorothy Edith 'Dolly'",Female,NaN,8,2,CA. 2343,69.55,NaN,Southampton,No,10
1175,Third,"Sage, Miss. Stella Anna",Female,NaN,8,2,CA. 2343,69.55,NaN,Southampton,No,10
1176,Third,"Sage, Mr. Douglas Bullen",Male,NaN,8,2,CA. 2343,69.55,NaN,Southampton,No,10
1177,Third,"Sage, Mr. Frederick",Male,NaN,8,2,CA. 2343,69.55,NaN,Southampton,No,10
1178,Third,"Sage, Mr. George John Jr",Male,NaN,8,2,CA. 2343,69.55,NaN,Southampton,No,10
1179,Third,"Sage, Mr. John George",Male,NaN,1,9,CA. 2343,69.55,NaN,Southampton,No,10
1180,Third,"Sage, Mrs. John (Annie Bullen)",Female,NaN,1,9,CA. 2343,69.55,NaN,Southampton,No,10

In [87]:
df_ticket_number = df['Ticket Number'].value_counts().to_frame().reset_index().rename(columns={'index':'Ticket Number', 'Ticket Number':'Ticket count'})
df = pd.merge(df, df_ticket_number, on='Ticket Number')
df["Single passenger fare"] = df["Passenger Fare"] / df["Ticket count"]
df

,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Survived,Family size,Ticket count,Single passenger fare
0,First,"Allen, Miss. Elisabeth Walton",Female,29.0000,0,0,24160,211.3375,B5,Southampton,Yes,0,4,52.834375
1,First,"Kreuchen, Miss. Emilie",Female,39.0000,0,0,24160,211.3375,NaN,Southampton,Yes,0,4,52.834375
2,First,"Madill, Miss. Georgette Alexandra",Female,15.0000,0,1,24160,211.3375,B5,Southampton,Yes,1,4,52.834375
3,First,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",Female,43.0000,0,1,24160,211.3375,B3,Southampton,Yes,1,4,52.834375
4,First,"Allison, Master. Hudson Trevor",Male,0.9167,1,2,113781,151.5500,C22 C26,Southampton,Yes,3,6,25.258333
5,First,"Allison, Miss. Helen Loraine",Female,2.0000,1,2,113781,151.5500,C22 C26,Southampton,No,3,6,25.258333
6,First,"Allison, Mr. Hudson Joshua Creighton",Male,30.0000,1,2,113781,151.5500,C22 C26,Southampton,No,3,6,25.258333
7,First,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0000,1,2,113781,151.5500,C22 C26,Southampton,No,3,6,25.258333
8,First,"Cleaver, Miss. Alice",Female,22.0000,0,0,113781,151.5500,NaN,Southampton,Yes,0,6,25.258333
9,First,"Daniels, Miss. Sarah",Female,33.0000,0,0,113781,151.5500,NaN,Southampton,Yes,0,6,25.258333
10,First,"Anderson, Mr. Harry",Male,48.0000,0,0,19952,26.5500,E12,Southampton,Yes,0,1,26.550000
11,First,"Andrews, Miss. Kornelia Theodosia",Female,63.0000,1,0,13502,77.9583,D7,Southampton,Yes,1,3,25.986100
12,First,"Hogeboom, Mrs. John C (Anna Andrews)",Female,51.0000,1,0,13502,77.9583,D11,Southampton,Yes,1,3,25.986100
13,First,"Longley, Miss. Gretchen Fiske",Female,21.0000,0,0,13502,77.9583,D9,Southampton,Yes,0,3,25.986100
14,First,"Andrews, Mr. Thomas Jr",Male,39.0000,0,0,112050,0.0000,A36,Southampton,No,0,1,0.000000
15,First,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",Female,53.0000,2,0,11769,51.4792,C101,Southampton,Yes,2,2,25.739600
16,First,"Brown, Mrs. John Murray (Caroline Lane Lamson)",Female,59.0000,2,0,11769,51.4792,C101,Southampton,Yes,2,2,25.739600
17,First,"Artagaveytia, Mr. Ramon",Male,71.0000,0,0,PC 17609,49.5042,NaN,Cherbourg,No,0,1,49.504200
18,First,"Astor, Col. John Jacob",Male,47.0000,1,0,PC 17757,227.5250,C62 C64,Cherbourg,No,1,5,45.505000
19,First,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",Female,18.0000,1,0,PC 17757,227.5250,C62 C64,Cherbourg,Yes,1,5,45.505000
20,First,"Bidois, Miss. Rosalie",Female,42.0000,0,0,PC 17757,227.5250,NaN,Cherbourg,Yes,0,5,45.505000
21,First,"Endres, Miss. Caroline Louise",Female,38.0000,0,0,PC 17757,227.5250,C45,Cherbourg,Yes,0,5,45.505000
22,First,"Robbins, Mr. Victor",Male,NaN,0,0,PC 17757,227.5250,NaN,Cherbourg,No,0,5,45.505000
23,First,"Aubart, Mme. Leontine Pauline",Female,24.0000,0,0,PC 17477,69.3000,B35,Cherbourg,Yes,0,2,34.650000
24,First,"Sagesser, Mlle. Emma",Female,24.0000,0,0,PC 17477,69.3000,B35,Cherbourg,Yes,0,2,34.650000
25,First,"Barber, Miss. Ellen 'Nellie'",Female,26.0000,0,0,19877,78.8500,NaN,Southampton,Yes,0,3,26.283333
26,First,"Cavendish, Mr. Tyrell William",Male,36.0000,1,0,19877,78.8500,C46,Southampton,No,1,3,26.283333
27,First,"Cavendish, Mrs. Tyrell William (Julia Florence...",Female,76.0000,1,0,19877,78.8500,C46,Southampton,Yes,1,3,26.283333
28,First,"Barkworth, Mr. Algernon Henry Wilson",Male,80.0000,0,0,27042,30.0000,A23,Southampton,Yes,0,1,30.000000
29,First,"Baumann, Mr. John D",Male,NaN,0,0,PC 17318,25.9250,NaN,Southampton,No,0,1,25.925000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1279,Third,"Vartanian, Mr. David",Male,22.0000,0,0,2658,7.2250,NaN,Cherbourg,Yes,0,1,7.225000
1280,Third,"Vendel, Mr. Olof Edvin",Male,20.0000,0,0,350416,7.8542,NaN,Southampton,No,0,1,7.854200
1281,Third,"Vestrom, Miss. Hulda Amanda Adolfina",Female,14.0000,0,0,350406,7.8542,NaN,Southampton,No,0,1,7.854200
1282,Third,"Vovk, Mr. Janko",Male,22.0000,0,0,349252,7.8958,NaN,Southampton,No,0,1,7.895800
1283,Third,"Waelens, Mr. Achille",Male,22.0000,0,0,345767,9.0000,NaN,Southampton,No,0,1,9.000000
1284,Third,"Ware, Mr. Frederick",Male,NaN,0,0,359309,8.0500,NaN,Southampton,No,0,1,8.050000
1285,Third,"Warren, Mr. Charles William",Male,NaN,0,0,C.A. 49867,7.5500,NaN,Southampton,No,0,1,7.550000
1286,Third,"Webber, Mr. James",Male,NaN,0,0,SOTON/OQ 3101316,8.0500,NaN,Southampton,No,0,1,8.050000
1287,Third,"Wenzel, Mr. Linhart",Male,32.5000,0,0,345775,9.5000,NaN,Southampton,No,0,1,9.500000
1288,Third,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",Female,38.0000,0,0,2688,7.2292,NaN,Cherbourg,Yes,0,1,7.229200
1289,Third,"Widegren, Mr. Carl/Charles Peter",Male,51.0000,0,0,347064,7.7500,NaN,Southampton,No,0,1,7.750000
1290,Third,"Wiklund, Mr. Jakob Alfred",Male,18.0000,1,0,3101267,6.4958,NaN,Southampton,No,1,1,6.495800
1291,Third,"Wiklund, Mr. Karl Johan",Male,21.0000,1,0,3101266,6.4958,NaN,Southampton,No,1,1,6.495800
1292,Third,"Wilkes, Mrs. James (Ellen Needs)",Female,47.0000,1,0,363272,7.0000,NaN,Southampton,Yes,1,1,7.000000
1293,Third,"Willer, Mr. Aaron ('Abi Weller')",Male,NaN,0,0,3410,8.7125,NaN,Southampton,No,0,1,8.712500
1294,Third,"Willey, Mr. Edward",Male,NaN,0,0,S.O./P.P. 751,7.5500,NaN,Southampton,No,0,1,7.550000
1295,Third,"Williams, Mr. Howard Hugh 'Harry'",Male,NaN,0,0,A/5 2466,8.0500,NaN,Southampton,No,0,1,8.050000
1296,Third,"Windelov, Mr. Einar",Male,21.0000,0,0,SOTON/OQ 3101317,7.2500,NaN,Southampton,No,0,1,7.250000
1297,Third,"Wirz, Mr. Albert",Male,27.0000,0,0,315154,8.6625,NaN,Southampton,No,0,1,8.662500
1298,Third,"Wiseman, Mr. Phillippe",Male,NaN,0,0,A/4. 34244,7.2500,NaN,Southampton,No,0,1,7.250000
1299,Third,"Wittevrongel, Mr. Camille",Male,36.0000,0,0,345771,9.5000,NaN,Southampton,No,0,1,9.500000
1300,Third,"Yasbeck, Mr. Antoni",Male,27.0000,1,0,2659,14.4542,NaN,Cherbourg,No,1,2,7.227100
1301,Third,"Yasbeck, Mrs. Antoni (Selini Alexander)",Female,15.0000,1,0,2659,14.4542,NaN,Cherbourg,Yes,1,2,7.227100
1302,Third,"Youseff, Mr. Gerious",Male,45.5000,0,0,2628,7.2250,NaN,Cherbourg,No,0,1,7.225000
1303,Third,"Yousif, Mr. Wazli",Male,NaN,0,0,2647,7.2250,NaN,Cherbourg,No,0,1,7.225000
1304,Third,"Zabour, Miss. Hileni",Female,14.5000,1,0,2665,14.4542,NaN,Cherbourg,No,1,2,7.227100
1305,Third,"Zabour, Miss. Thamine",Female,NaN,1,0,2665,14.4542,NaN,Cherbourg,No,1,2,7.227100
1306,Third,"Zakarian, Mr. Mapriededer",Male,26.5000,0,0,2656,7.2250,NaN,Cherbourg,No,0,1,7.225000
1307,Third,"Zakarian, Mr. Ortin",Male,27.0000,0,0,2670,7.2250,NaN,Cherbourg,No,0,1,7.225000
1308,Third,"Zimmerman, Mr. Leo",Male,29.0000,0,0,315082,7.8750,NaN,Southampton,No,0,1,7.875000

In [105]:
#df.fillna(df.mean())
# col with nan values {'Cabin' - categorical, 'Port of Embarkation' - categorical, 
#'Single passenger fare' - num, 'Passenger Fare' - num, 'Age' - num}
# `Passenger Class`, `Sex`, `Embarkation Port`
if __name__ == '__main__':
    def nan_to_average(data):
        data_mean_val = data.groupby(["Passenger Class", "Sex", "Port of Embarkation"])["Single passenger fare"].mean()
        # sign for modification
        data["IsModified"] = 0
        for index, row in data.iterrows():
            for el in row:
                #if type(el) != str and el !="":
                if (row[row == el].index[0] == "Single passenger fare") and math.isnan(el):
                    data["IsModified"][index] = 1
                    data["Single passenger fare"][index] = data_mean_val.loc[(row.at["Passenger Class"],row.at["Sex"],row.at["Port of Embarkation"])]
        return data
    nan_to_average(df)

IndexError: index 0 is out of bounds for axis 0 with size 0

In [90]:
df.groupby(["Passenger Class", "Sex", "Port of Embarkation"])["Single passenger fare"].mean()

Passenger Class  Sex     Port of Embarkation
First            Female  Cherbourg              38.668365
                         Queenstown             30.000000
                         Southampton            32.516189
                 Male    Cherbourg              37.856094
                         Queenstown             30.000000
                         Southampton            29.132124
Second           Female  Cherbourg              12.538476
                         Queenstown             12.350000
                         Southampton            11.273342
                 Male    Cherbourg              13.762104
                         Queenstown             11.489160
                         Southampton            11.130229
Third            Female  Cherbourg               6.292523
                         Queenstown              7.687132
                         Southampton             6.965251
                 Male    Cherbourg               7.087964
                         Queenstown              7.469444
                         Southampton             7.515217
Name: Single passenger fare, dtype: float64

In [104]:
for index, row in df.iterrows():
            for el in row:
                print(row[row == "First"].index[0])
                #print(pd.Index(row).get_loc("First")) #Index(myseries).get_loc(7)
                break
            break

Passenger Class

In [95]:
type(2) != str

True

In [93]:
el

'First'